<script setup lang="ts">
import IndentLine from '@/components/Works/IndentLine.vue';
import { defineProps } from 'vue';
interface Prop {
  productName?: string
}
const prop = defineProps<Prop>()

const product = prop.productName ?? '配布物'
const generalProduct = prop.productName ? '本サービス' : '配布物'
</script>

<template>
  <h1 class="q-mt-none">{{ product }}利用規約</h1>
  <p>
    この規約（以下「本規約」）は、お客様が、斜向（以下「当団体」）が提供する{{ product }}（以下「{{ generalProduct }}」）をご利用頂く際の取扱いにつき定めるものです。
  </p>
  <p>
    本規約に同意した上で当団体が提供する製品をご利用ください。
  </p>
  <p>
    なお、<a href="/works/broadcast">投稿規約</a>は、本規約と一体となって{{ generalProduct }}の利用に適用されるものとします。
  </p>
  <p>
    また、本サイトで配布される配布物はMojang ABが作成または承認したものではなく、当団体がプレイアブルコンテンツの提供を目的として独自に企画、開発したものです。
  </p>

  <h2>第１条（定義）</h2>
  <p>
    本規約上で使用する用語の定義は、次に掲げるとおりとします。
  </p>
  <ol>
    <li><IndentLine title="本サイト" :comment="`${generalProduct}のコンテンツが掲載されたウェブサイト`"/></li>
    <li><IndentLine title="本コンテンツ" :comment="`${generalProduct}上で提供される文字、音、静止画、動画、ソフトウェアプログラム、コード等の総称（投稿情報を含む）`"/></li>
    <li><IndentLine title="利用者" :comment="`${generalProduct}を利用する全ての方`"/></li>
    <li><IndentLine title="個人情報" comment="住所、氏名、職業、電話番号等個人を特定することのできる情報の総称"/></li>
    <li><IndentLine title="知的財産" comment="発明、考案、植物の新品種、意匠、著作物その他の人間の創造的活動により生み出されるもの（発見または解明がされた自然の法則または現象であって、産業上の利用可能性があるものを含む）、商標、商号その他事業活動に用いられる商品または役務を表示するもの及び営業秘密その他の事業活動に有用な技術上または営業上の情報"/></li>
  </ol>

  <h2>第２条（本規約への同意）</h2>
  <ol>
    <li>利用者は、本利用規約に同意頂いた上で、{{ generalProduct }}を利用できるものとします。</li>
    <li>利用者が、{{ generalProduct }}をデスクトップPCその他の情報端末にダウンロードする際に、本規約への同意手続を行った時点で、利用者と当団体との間で、本規約の諸規定に従った利用契約が成立するものとします。</li>
    <li>利用者が未成年者である場合には、親権者その他の法定代理人の同意を得たうえで、{{ generalProduct }}をご利用ください。</li>
    <li>未成年者の利用者が、法定代理人の同意がないにもかかわらず同意があると偽りまたは年齢について成年と偽って{{ generalProduct }}を利用した場合、その他行為能力者であることを信じさせるために詐術を用いた場合、{{ generalProduct }}に関する一切の法律行為を取り消すことは出来ません。</li>
    <li>本規約の同意時に未成年であった利用者が成年に達した後に{{ generalProduct }}を利用した場合、当該利用者は{{ generalProduct }}に関する一切の法律行為を追認したものとみなされます。</li>
  </ol>

  <h2>第３条（規約の変更）</h2>
  <ol>
    <li>当団体は、利用者の承諾を得ることなく、いつでも、本規約の内容を改定することができるものとし、利用者はこれを異議なく承諾するものとします。</li>
    <li>当団体は、本規約を改定するときは、その内容について本サイトを通じて利用者に通知します。</li>
    <li>前本規約の改定の効力は、当団体が前項により通知を行った時点から生じるものとします。</li>
    <li>利用者は、本規約変更後、{{ generalProduct }}を利用した時点で、変更後の本規約に異議なく同意したものとみなされます。</li>
  </ol>

  <h2>第４条（{{ generalProduct }}の一時中断、停止）</h2>
  <p>
    当団体は以下に該当する場合、利用者への事前の告知なしで、{{ generalProduct }}の一部または全部を一時停止または中止することができるものとします。
  </p>
  <ol>
    <li>{{ generalProduct }}の保守点検、更新を定期的または緊急に行う場合</li>
    <li>利用者からのアクセスが逼迫するなど、システムの容量を超える利用がなされた場合</li>
    <li>火災、停電、天災などの不可抗力により、{{ generalProduct }}の提供が困難な場合</li>
    <li>運用上または技術上の理由により、当団体が{{ generalProduct }}の一時停止または中止が必要であると判断した場合</li>
    <li>その他、不測の事態により当団体が{{ generalProduct }}の提供が困難と判断した場合</li>
  </ol>

  <h2>第５条（{{ generalProduct }}の変更と終了）</h2>
  <ol>
    <li>当団体は、利用者に事前に告知することなく、当団体の判断により{{ generalProduct }}内容の一部または全部を変更できるものとします。</li>
    <li>当団体は、利用者に事前に告知することなく当団体の判断により{{ generalProduct }}内容の一部または全部を終了できるものとします。</li>
    <li>当団体は、{{ generalProduct }}内容の変更による利用者及び第三者の不利益に対し一切の責任を負わないものとします。</li>
  </ol>

  <h2>第６条（費用負担）</h2>
  <p>
    {{ generalProduct }}を利用するにあたり必要となる端末機器、通信機器、通信手段及び電力等は、利用者の費用と責任で用意するものとします。
  </p>

  <h2>第７条（禁止行為）</h2>
  <p>
    {{ generalProduct }}の利用に際し、当団体は、利用者に対し、次に掲げる行為を禁止します。
  </p>
  <ol>
    <li>当団体または第三者の知的財産権を侵害する行為</li>
    <li>当団体または第三者の名誉・信用を毀損または不当に差別もしくは誹謗中傷する行為</li>
    <li>当団体または第三者の財産を侵害する行為、または侵害する恐れのある行為</li>
    <li>当団体または第三者に経済的損害を与える行為</li>
    <li>当団体または第三者に対する脅迫的な行為</li>
    <li>配布物に対して編集・加工等を行い、第三者に配布する行為</li>
    <li>コンピューターウィルス、有害なプログラムを仕様またはそれを誘発する行為</li>
    <li>{{ generalProduct }}用インフラ設備に対して過度な負担となるストレスをかける行為</li>
    <li>当サイトのサーバーやシステム、セキュリティへの攻撃</li>
    <li>当団体提供のインターフェース以外の方法で当団体サービスにアクセスを試みる行為</li>
    <li>上記の他、当団体が不適切と判断する行為</li>
  </ol>

  <h2>第８条（規約違反行為に対する措置）</h2>
  <ol>
    <li>当団体は利用者が本規約及び各種規約等の何らの条項に違反した場合、当団体は平均的な損害の額に基づいた違約金の請求、合理的な弁護士費用も含む損害賠償請求等の措置を取ることができます。</li>
    <li>利用者の規約違反行為に関連し、これに生起する第三者との間の法的請求や責任について、当団体は一切責任を負わず、利用規約等に違反した利用者は、自己の責任においてこれを処理し、当団体に一切の迷惑や損害を与えないことを保証します。</li>
    <li>前項の法的請求が当団体に対して行われ、当団体が何らの損害を被った場合、利用者は、合理的な弁護士費用も含め、当団体が要した費用一切につき、これを補償します。</li>
    <li>本コンテンツ又はその使用用途等について利用規約等違反の報告が当団体にあった場合、当団体は、当該違反の是正について合理的な範囲での最善の措置を講ずるよう努め、当団体の裁量で当団体が行う対応を決定することができます。</li>
  </ol>

  <h2>第９条（免責）</h2>
  <ol>
    <li>当団体は、{{ generalProduct }}の内容変更、中断、終了によって生じたいかなる損害についても、一切責任を負いません。</li>
    <li>当団体は、利用者の{{ generalProduct }}の利用環境について一切関与せず、また一切の責任を負いません。</li>
    <li>当団体は、{{ generalProduct }}が利用者の特定の目的に適合すること、期待する機能・商品的価値・正確性・有用性を有すること、利用者による{{ generalProduct }}の利用が利用者に適用のある法令または業界団体の内部規則等に適合すること、および不具合が生じないことについて、何ら保証するものではありません。</li>
    <li>当団体は、{{ generalProduct }}が全ての情報端末に対応していることを保証するものではなく、{{ generalProduct }}の利用に供する情報端末のＯＳのバージョンアップ等に伴い、{{ generalProduct }}の動作に不具合が生じる可能性があることにつき、利用者はあらかじめ了承するものとします。当団体は、かかる不具合が生じた場合に当団体が行うプログラムの修正等により、当該不具合が解消されることを保証するものではありません。</li>
    <li>利用者は、GitHub, Google Drive等のサービスストアの利用規約および運用方針の変更等に伴い、{{ generalProduct }}の一部又は全部の利用が制限される可能性があることをあらかじめ了承するものとします。</li>
    <li>当団体は、{{ generalProduct }}を利用したことにより直接的または間接的に利用者に発生した損害について、一切賠償責任を負いません。</li>
    <li>当団体は、利用者その他の第三者に発生した機会逸失、業務の中断その他いかなる損害（間接損害や逸失利益を含みます）に対して、当団体が係る損害の可能性を事前に通知されていたとしても、一切の責任を負いません。</li>
    <li>第１項乃至前項の規定は、当団体に故意または重過失が存する場合又は契約書が消費者契約法上の消費者に該当する場合には適用しません。</li>
    <li>前項が適用される場合であっても、当団体は、過失（重過失を除きます。）による行為によって利用者に生じた損害のうち、特別な事情から生じた損害については、一切賠償する責任を負わないものとします。</li>
    <li>{{ generalProduct }}の利用に関し当団体が損害賠償責任を負う場合、当該損害が発生した月に利用者から受領した利用額を限度として賠償責任を負うものとします。</li>
    <li>利用者と他の利用者との間の紛争及びトラブルについて、当団体は一切責任を負わないものとします。利用者と他の利用者でトラブルになった場合でも、両者同士の責任で解決するものとし、当団体には一切の請求をしないものとします。</li>
    <li>利用者は、{{ generalProduct }}の利用に関連し、他の利用者に損害を与えた場合または第三者との間に紛争を生じた場合、自己の費用と責任において、かかる損害を賠償またはかかる紛争を解決するものとし、当団体には一切の迷惑や損害を与えないものとします。</li>
    <li>利用者の行為により、第三者から当団体が損害賠償等の請求をされた場合には、利用者の費用（弁護士費用）と責任で、これを解決するものとします。当団体が、当該第三者に対して、損害賠償金を支払った場合には、利用者は、当団体に対して当該損害賠償金を含む一切の費用（弁護士費用及び逸失利益を含む）を支払うものとします。</li>
    <li>利用者が{{ generalProduct }}の利用に関連して当団体に損害を与えた場合、利用者の費用と責任において当団体に対して損害を賠償（訴訟費用及び弁護士費用を含む）するものとします。</li>
  </ol>

  <h2>第１０条（権利譲渡の禁止）</h2>
  <ol>
    <li>利用者は、予め当団体の書面による承諾がない限り、本規約上の地位および本規約に基づく権利または義務の全部または一部を第三者に譲渡してはならないものとします。</li>
    <li>当団体は、{{ generalProduct }}の全部または一部を当団体の裁量により第三者に譲渡することができ、その場合、譲渡された権利の範囲内で利用者のアカウントを含む、{{ generalProduct }}に係る利用者の一切の権利が譲渡先に移転するものとします。</li>
  </ol>

  <h2>第１１条（分離可能性）</h2>
  <p>
    本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効又は執行不能と判断された場合であっても、本規約の残りの規定及び一部が無効又は執行不能と判断された規定の残りの部分は、継続して完全に効力を有するものとします。
  </p>

  <h2>第１２条（当団体への連絡方法）</h2>
  <p>
    {{ generalProduct }}に関する利用者の当団体へのご連絡・お問い合わせは、<a href="/contact">当団体が本サイト上で指定する方法</a>により行うものとします。
  </p>

  <h2>第１３条（準拠法、管轄裁判所）</h2>
  <ol>
    <li>本規約の有効性，解釈及び履行については，日本法に準拠し，日本法に従って解釈されるものとします。</li>
    <li>本規約に関して当団体と利用者等との間での論議・訴訟その他一切の紛争については、訴額に応じて、東京簡易裁判所又は東京地方裁判所を第一審の専属的合意管轄裁判所とします｡</li>
  </ol>

  <h3 class="q-mb-none">２０２３年５月１５日  施行</h3>
</template>